# RebarShapeConstraintAngleFromFixedDir Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintAngleFromFixedDir Class
Members See Also
---
A constraint which can be applied to a RebarShapeSegment and drives the angle of the segment relative to a fixed direction in UV-space.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class RebarShapeConstraintAngleFromFixedDir : RebarShapeConstraint
```

Visual Basic
---
```text
Public Class RebarShapeConstraintAngleFromFixedDir _
	Inherits RebarShapeConstraint
```

Visual C++
---
```text
public ref class RebarShapeConstraintAngleFromFixedDir : public RebarShapeConstraint
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarShapeConstraint Autodesk.Revit.DB.Structure..::..RebarShapeConstraintAngleFromFixedDir
# See Also
RebarShapeConstraintAngleFromFixedDir Members
Autodesk.Revit.DB.Structure Namespace